#!/bin/bash

BE_DIR=/home/ec2-user/deploy/backend
BE_BUILD_DIR=$BE_DIR/build/libs

echo "###########################################"
echo "# 실행 중인 스프링 부트 애플리케이션 중지 #"
echo "###########################################"
CURRENT_PID=$(pgrep -fl "damoa-0" | grep java | awk '{print $1}')
if [ -z "$CURRENT_PID" ]; then
        echo "#######################################################"
        echo "# 현재 실행 중인 스프링 부트 애플리케이션은 없습니다. #"
        echo "#######################################################"
else
        echo "#########################################################"
        echo "# 현재 실행 중인 스프링 부트 애플리케이션 포트 : $CURRENT_PID #"
        echo "#########################################################"
        kill -15 $CURRENT_PID
        sleep 5
        echo "################################################"
        echo "# 실행 중인 스프링 부트 애플리케이션 중지 성공 #"
        echo "################################################"
fi
echo ""

echo "#################################"
echo "# 스프링 부트 애플리케이션 실행 #"
echo "#################################"
JAR_NAME=$(ls -tr $BE_DIR/*.jar | tail -n 1)
echo "# JAR name : $JAR_NAME"

nohup java -jar $JAR_NAME > $BE_DIR/nohup.out 2>&1 &
echo "######################################"
echo "# 스프링 부트 애플리케이션 실행 성공 #"
echo "######################################"
echo ""

echo "########################"
echo "### 백엔드 배포 종료 ###"
echo "########################"
echo ""